Revit 2026 API

# RebarUpdateCurvesDataSetCycleCounter Method

---

Sets the cycle counter to a specific value.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCycleCounter(
	int cycleCounter
)
```
```vb
Public Sub SetCycleCounter (
	cycleCounter As Integer
)
```
```cpp
public:
void SetCycleCounter(
	int cycleCounter
)
```
```fsharp
member SetCycleCounter :
        cycleCounter : int -> unit
```

#### Parameters

cycleCounter Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The given value for cycleCounter is negative. |

The actual value is set into the rebar after the curves computation.

This function can be called to reset the counter to zero or to another value.

The cycle counter value is changed when the free form Rebar element is selected and the user press Space key -or- by through [!:Autodesk::Revit::DB::Structure::RebarRebarFreeFormAccessor::CycleCounter] property. -or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0).

#### Reference

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace